app/controllers/empleados_controller.rb

SELECT * FROM "empleados"
---
  def index
    @empleados = Empleado.all

SELECT * FROM "empleados" WHERE ("empleados"."id" = 2)
---
  def show
    @empleado = Empleado.find(params[:id])

SELECT * FROM "empleados" WHERE ("empleados"."id" = 1)
---
  def edit
    @empleado = Empleado.find(params[:id])

INSERT INTO "empleados" ("telefono", "nombre", "puesto_id", "correo", "area_id", "materno", "paterno") VALUES('989844', 'JUAN MANUEL', 2, 'rr', NULL, 'MATUS', 'PEREZ')
---
  def create
    @empleado = Empleado.new(params[:empleado])

    respond_to do |format|
      if @empleado.save